-- phpMyAdmin SQL Dump
-- version 4.4.15.8
-- https://www.phpmyadmin.net
--
-- Host: 10.10.154.38
-- Generation Time: 2017-05-03 08:05:41
-- 服务器版本： 5.5.24-ucloudrel1-log
-- PHP Version: 5.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `onlinedb`
--

-- --------------------------------------------------------

--
-- 表的结构 `province`
--

CREATE TABLE IF NOT EXISTS `province` (
  `id` varchar(64) NOT NULL,
  `name` varchar(64) DEFAULT 'NULL',
  `name_en` varchar(64) DEFAULT 'NULL',
  `code` varchar(8) DEFAULT 'NULL',
  `country_id` varchar(8) NOT NULL DEFAULT 'NULL',
  `updatetime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `disable` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `province`
--

INSERT INTO `province` (`id`, `name`, `name_en`, `code`, `country_id`, `updatetime`, `disable`) VALUES
('p501001', '阿拉斯加州', 'Alaska', 'AK', '501', '2017-03-30 04:02:40', 0),
('p501002', '亚拉巴马州', 'Alabama', 'AL', '501', '2017-03-30 04:02:40', 0),
('p501003', '阿肯色州', 'Arkansas', 'AR', '501', '2017-03-30 04:02:40', 0),
('p501004', '亚利桑那州', 'Arizona', 'AZ', '501', '2017-03-30 04:02:40', 0),
('p501005', '加利福尼亚州', 'California', 'CA', '501', '2017-03-30 04:02:40', 0),
('p501006', '科罗拉多州', 'Colorado', 'CO', '501', '2017-03-30 04:02:40', 0),
('p501007', '康涅狄格州', 'Connecticut', 'CT', '501', '2017-03-30 04:02:40', 0),
('p501008', '特拉华州', 'Delaware', 'DE', '501', '2017-03-30 04:02:40', 0),
('p501009', '佛罗里达州', 'Florida', 'FL', '501', '2017-03-30 04:02:40', 0),
('p501010', '佐治亚州', 'Georgia', 'GA', '501', '2017-03-30 04:02:40', 0),
('p501011', '夏威夷州', 'Hawaii', 'HI', '501', '2017-03-30 04:02:40', 0),
('p501012', '艾奥瓦州', 'Iowa', 'IA', '501', '2017-03-30 04:02:40', 0),
('p501013', '爱达荷州', 'Idaho', 'ID', '501', '2017-03-30 04:02:40', 0),
('p501014', '伊利诺伊州', 'Illinois', 'IL', '501', '2017-03-30 04:02:40', 0),
('p501015', '印第安纳州', 'Indiana', 'IN', '501', '2017-03-30 04:02:40', 0),
('p501016', '堪萨斯州', 'Kansas', 'KS', '501', '2017-03-30 04:02:40', 0),
('p501017', '肯塔基州', 'Kentuck ', 'KY', '501', '2017-03-30 04:02:40', 0),
('p501018', '路易斯安那州', 'Louisiana', 'LA', '501', '2017-03-30 04:02:40', 0),
('p501019', '马萨诸塞州', 'Massachusett ', 'MA', '501', '2017-03-30 04:02:40', 0),
('p501020', '马里兰州', 'Maryland', 'MD', '501', '2017-03-30 04:02:40', 0),
('p501021', '缅因州', 'Maine', 'ME', '501', '2017-03-30 04:02:40', 0),
('p501022', '密歇根州', 'Michigan', 'MI', '501', '2017-03-30 04:02:40', 0),
('p501023', '明尼苏达州', 'Minnesota', 'MN', '501', '2017-03-30 04:02:40', 0),
('p501024', '密苏里州', 'Missouri', 'MO', '501', '2017-03-30 04:02:40', 0),
('p501025', '密西西比州', 'Mississippi', 'MS', '501', '2017-03-30 04:02:40', 0),
('p501026', '蒙大拿州', 'Montana', 'MT', '501', '2017-03-30 04:02:40', 0),
('p501027', '北卡罗来纳州', 'North Carolina', 'NC', '501', '2017-03-30 04:02:40', 0),
('p501028', '北达科他州', 'North Dakota', 'ND', '501', '2017-03-30 04:02:40', 0),
('p501029', '内布拉斯加州', 'Nebraska', 'NE', '501', '2017-03-30 04:02:40', 0),
('p501030', '新罕布什尔州', 'New Hampshire', 'NH', '501', '2017-03-30 04:02:40', 0),
('p501031', '新泽西州', 'New  Jersey', 'NJ', '501', '2017-03-30 04:02:40', 0),
('p501032', '新墨西哥州', 'New  Mexico', 'NM', '501', '2017-03-30 04:02:40', 0),
('p501033', '内华达州', 'Nevada', 'NV', '501', '2017-03-30 04:02:40', 0),
('p501034', '纽约州', 'New  York', 'NY', '501', '2017-03-30 04:02:40', 0),
('p501035', '俄亥俄州', 'Ohio', 'OH', '501', '2017-03-30 04:02:40', 0),
('p501036', '俄克拉荷马州', 'Oklahoma', 'OK', '501', '2017-03-30 04:02:40', 0),
('p501037', '俄勒冈州', 'Oregon', 'OR', '501', '2017-03-30 04:02:40', 0),
('p501038', '宾夕法尼亚州', 'Pennsylvani', 'PA', '501', '2017-03-30 04:02:40', 0),
('p501039', '罗得岛', 'Rhode  Islan', 'RI', '501', '2017-03-30 04:02:40', 0),
('p501040', '南卡罗来纳州', 'South  Carolina', 'SC', '501', '2017-03-30 04:02:40', 0),
('p501041', '南达科他州', 'South  Dakota', 'SD', '501', '2017-03-30 04:02:40', 0),
('p501042', '田纳西州', 'Tennessee', 'TN', '501', '2017-03-30 04:02:40', 0),
('p501043', '德克萨斯州', 'Texas', 'TX', '501', '2017-03-30 04:02:40', 0),
('p501044', '犹他州', 'Utah', 'UT', '501', '2017-03-30 04:02:40', 0),
('p501045', '弗吉尼亚州', 'Virgini ', 'VA', '501', '2017-03-30 04:02:40', 0),
('p501046', '佛蒙特州', 'Vermont', 'VT', '501', '2017-03-30 04:02:40', 0),
('p501047', '华盛顿州', 'Washington', 'WA', '501', '2017-03-30 04:02:40', 0),
('p501048', '威斯康星州', 'Wisconsin', 'WI', '501', '2017-03-30 04:02:40', 0),
('p501049', '西弗吉尼亚州', 'West  Virginia', 'WV', '501', '2017-03-30 04:02:40', 0),
('p501050', '怀俄明州', 'Wyoming', 'WY', '501', '2017-03-30 04:02:40', 0),
('p501051', '华盛顿哥伦比亚特区', 'District of Columbia', 'DC', '501', '2017-03-30 04:02:40', 0),
('p501052', '美属萨摩亚', ' American Samoa', 'AS', '501', '2017-03-30 04:02:40', 0),
('p501053', '关岛', 'Guam', 'GU', '501', '2017-03-30 04:02:40', 0),
('p501054', ' 北马里亚纳群', 'Northern Mariana Islands', 'MP', '501', '2017-03-30 04:02:40', 0),
('p501055', '美属维尔京群岛', 'U.S. Virgin Islands', 'VI', '501', '2017-03-30 04:02:40', 0),
('p502001', '艾伯塔省', ' Alberta', 'AB', '502', '2017-03-30 04:02:40', 0),
('p502002', '不列颠哥伦比亚省', 'British Columbia', 'BC', '502', '2017-03-30 04:02:40', 0),
('p502003', '马尼托巴省', 'Manitoba', 'MB', '502', '2017-03-30 04:02:40', 0),
('p502004', '纽芬兰与拉布拉多省', 'Newfoundland and Labrador', 'NL', '502', '2017-03-30 04:02:40', 0),
('p502005', '新不伦瑞克省', 'New Brunswick', 'NB', '502', '2017-03-30 04:02:40', 0),
('p502006', '新斯科舍省', 'Nova Scotia', 'NS', '502', '2017-03-30 04:02:40', 0),
('p502007', '安大略省', 'Ontario', 'ON', '502', '2017-03-30 04:02:40', 0),
('p502008', '爱德华王子岛', 'Prince Edward Island', 'PE', '502', '2017-03-30 04:02:40', 0),
('p502009', '魁北克省', 'Quebec', 'QC', '502', '2017-03-30 04:02:40', 0),
('p502010', '萨斯喀彻温省', ' Saskatchewan', 'SK', '502', '2017-03-30 04:02:40', 0),
('p502011', '努纳武特地区', 'Nunavut', 'NU', '502', '2017-03-30 04:02:40', 0),
('p502012', '西北地区', 'Northwest Territories', 'NT', '502', '2017-03-30 04:02:40', 0),
('p502013', '育空地区', 'Yukon', 'YT', '502', '2017-03-30 04:02:40', 0),
('p133001', '巴厘岛', 'Bali', '', '133', '2017-04-28 04:16:42', 0),
('p121001', '爱媛县', 'Ehime Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121002', '爱知县', 'Aichi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121003', '北海道', 'Hokkaido', '', '121', '2017-04-28 04:16:42', 0),
('p121004', '兵库县', 'Hyōgo Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121005', '冲绳县', 'Okinawa Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121006', '茨城县', 'Ibaraki Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121007', '大阪府', 'Osaka Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121008', '大分县', 'Ōita Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121009', '岛根县', 'Shimane Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121010', '德岛县', 'Tokushima Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121011', '东京都', 'Tokyo', '', '121', '2017-04-28 04:16:42', 0),
('p121012', '福岛县', 'Fukushima Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121013', '福冈县', 'Fukuoka Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121014', '福井县', 'Fukui Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121015', '富山县', 'Toyama Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121016', '冈山县', 'Okayama Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121017', '高知县', 'Kōchi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121018', '宫城县', 'Miyagi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121019', '宫崎县', 'Miyazaki Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121020', '广岛县', 'Hiroshima Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121021', '和歌山县', 'Wakayama Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121022', '京都府', 'Kyoto Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121023', '静冈县', 'Shizuoka Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121024', '栃木县', 'Tochigi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121025', '鹿儿岛县', 'Kagoshima Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121026', '奈良县', 'Nara Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121027', '鸟取县', 'Tottori Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121028', '岐阜县', 'Gifu Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121029', '埼玉县', 'Saitama Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121030', '千叶县', 'Chiba Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121031', '青森县', 'Aomori Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121032', '秋田县', 'Akita Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121033', '群马县', 'Gunma Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121034', '三重县', 'Mie Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121035', '山口县', 'Yamaguchi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121036', '山梨县', 'Yamanashi Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121037', '山形县', 'Yamagata Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121038', '神奈川县', 'Kanagawa Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121039', '石川县', 'Ishikawa Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121040', '香川县', 'Kagawa Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121041', '新潟县', 'Niigata Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121042', '熊本县', 'Kumamoto Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121043', '岩手县', 'Iwate Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121044', '长崎县', 'Nagasaki Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121045', '长野县', 'Nagano Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121046', '滋贺县', 'Shiga Prefecture', '', '121', '2017-04-28 04:16:42', 0),
('p121047', '佐贺县', 'Saga Prefecture', '', '121', '2017-04-28 04:16:42', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `province`
--
ALTER TABLE `province`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `province`
--
ALTER TABLE `province`
AUTO_INCREMENT=19760;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
